{
  "PageType": 0,
  "ColumnCount": 52,
  "RowCount": 57,
  "Formulas": {
    "39,22": "R40-Q40+M40",
    "39,14": "IFERROR(ODATA(\"자재_?$select=반입누계량&$filter=ID eq \"&IF(ISBLANK(I40),\"null\",I40)),\"\")",
    "39,21": "O40+M40",
    "12,6": "E13",
    "11,6": "E12",
    "14,6": "E15",
    "13,6": "E14",
    "16,6": "E17",
    "15,6": "E16",
    "18,6": "E19",
    "17,6": "E18",
    "20,6": "E21",
    "19,6": "E20",
    "21,6": "E22",
    "22,6": "E23",
    "23,6": "E24",
    "24,6": "E25",
    "25,6": "E26",
    "26,6": "E27",
    "27,6": "E28",
    "28,6": "E29",
    "29,6": "E30",
    "30,6": "E31",
    "31,6": "E32",
    "32,6": "E33",
    "33,6": "E34",
    "34,6": "E35",
    "35,6": "E36",
    "36,4": "SUM(E12:F36)",
    "36,6": "SUM(G12:H36)",
    "5,13": "IF(상태=\"새로만들기\",\"\",\"승인\")",
    "5,15": "IF(상태=\"소장 승인\",\"승인\",IF(상태=\"최종 승인\",\"승인\",IF(AND(상태=\"반려\",최종개정인=\"소장\"),\"승인\",IF(상태=\"반려\",\"반려\",\" \"))))",
    "5,16": "IF(상태=\"최종 승인\",\"승인\",IF(AND(상태=\"반려\",최종개정인=\"대표이사\"),\" \",IF(AND(상태=\"반려\",최종개정인=\"소장\"),\"반려\",\" \")))",
    "5,18": "IF(AND(상태=\"반려\",최종개정인=\"대표이사\"),\"반려\",IF(상태=\"최종 승인\",\"승인\",IF(AND(상태=\"반려\",최종개정인=\"소장\"),\"반려\",\" \")))",
    "40,14": "IFERROR(ODATA(\"자재_?$select=반입누계량&$filter=ID eq \"&IF(ISBLANK(I41),\"null\",I41)),\"\")",
    "41,14": "IFERROR(ODATA(\"자재_?$select=반입누계량&$filter=ID eq \"&IF(ISBLANK(I42),\"null\",I42)),\"\")",
    "42,14": "IFERROR(ODATA(\"자재_?$select=반입누계량&$filter=ID eq \"&IF(ISBLANK(I43),\"null\",I43)),\"\")",
    "6,23": "ODATA(\"공사일보테이블?$select=상태&$filter=ID eq \"&IF(ISBLANK(A1),\"null\",A1))"
  },
  "CustomNames": [
    {
      "Name": "상태",
      "Formula": "공사일보!$X$7"
    },
    {
      "Name": "최종개정인",
      "Formula": "공사일보!$X$8"
    }
  ]
}